# desktop applications 
cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'caskroom/versions'

# system
cask 'docker'
cask 'java'
cask 'iterm2'
cask 'sogouinput'
cask 'shadowsocksx-ng'
cask 'snipaste'
# usb network sharing driver
cask 'horndis'

# productivity
cask 'alfred'
cask 'xmind'
cask 'near-lock'
cask 'hammerspoon'
cask 'appcleaner'
cask 'cheatsheet'
cask 'cleanmymac'

# editor
cask 'sublime-text'
cask 'atom'
cask 'macdown'
cask 'gitbook-editor'
brew 'emacs', args: ["with-cocoa", "with-gnutls"]

# storage
cask 'baidunetdisk'
cask 'baiducloud'
cask 'evernote'
cask 'dash'
cask 'thunder'
cask '1password'
cask 'nutstore'

# broswer
cask 'firefox'
cask 'google-chrome'

# study
cask 'kindle'
cask 'youdaodict'

# entertain
cask 'neteasemusic'
cask 'qqmusic'

# communication
cask 'qq'

# terminal apps
## network
brew 'telnet'
brew 'nmap'
brew 'axel' # multiple thread downloader

brew 'cmake'
brew 'tig'
brew 'ag'
brew 'jq'
brew 'autojump'
brew 'git'
brew 'vim'
brew 'zsh'
brew 'tldr'
brew 'zsh-completions'
brew 'graphviz'

brew 'reattach-to-user-namespace'
brew 'tmux'
brew 'tmuxinator-completion'
brew 'mycli'
# code statictis
brew 'cloc'
brew 'golang'
brew 'maven'
brew 'fzf'
brew 'node@6'
brew 'watch'

brew 'zplug'

# other
cask 'logitech-options'
