
# desktop applications 
cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/versions'
tap 'd12frosted/emacs-plus'

# system
cask 'docker'
cask 'java'
cask 'iterm2'
cask 'sogouinput'
# usb network sharing driver
cask 'horndis'

# productivity 
cask 'alfred'
cask 'appcleaner'
cask 'cheatsheet'
cask 'slate'

# editor
cask 'sublime-text'
cask 'atom'
cask 'macdown'
cask 'gitbook-editor'
brew 'emacs-plus'

# storage
cask 'baidunetdisk'
cask 'evernote'
cask 'dropbox'
cask 'dash'
cask 'thunder'
cask '1password'

# broswer
cask 'firefox'
cask 'google-chrome'

# study
cask 'youdao'
cask 'kindle'

# entertain
cask 'neteasemusic'
cask 'qqmusic'

# communication
cask 'qq'
cask 'skype'

# cooperate
cask 'screenhero'

# for dev env
#cask 'vagrant'
#cask 'virtualbox'

# terminal apps
brew 'cmake'
brew 'nmap'
brew 'tig'
brew 'ag'
brew 'jq'
brew 'autojump'
brew 'git'
brew 'vim'
brew 'zsh'
brew 'zsh-completions'

brew 'reattach-to-user-namespace' 
brew 'tmux'
brew 'tmuxinator-completion'
brew 'mycli'
# multiple thread downloader
brew 'axel'
# code statictis
brew 'cloc'
brew 'golang'
brew 'maven'
brew 'fzf'
brew 'node@6'
brew 'watch'

brew 'zplug'
